read_liberty -lib ~/skywater-pdk/libraries/sky130_fd_sc_hs/latest/timing/sky130_fd_sc_hs__tt_025C_2v10.lib
read_verilog_file_list -f ./scripts/file_list.txt
synth -top mt_cpu
flatten
dfflibmap -liberty ~/skywater-pdk/libraries/sky130_fd_sc_hs/latest/timing/sky130_fd_sc_hs__tt_025C_2v10.lib
abc -liberty ~/skywater-pdk/libraries/sky130_fd_sc_hs/latest/timing/sky130_fd_sc_hs__tt_025C_2v10.lib
clean
write_verilog -noattr -noexpr -nohex -nodec ./scripts/syn.v
stat -liberty ~/skywater-pdk/libraries/sky130_fd_sc_hs/latest/timing/sky130_fd_sc_hs__tt_025C_2v10.lib -tech cmos
